[
    {
        "id": 1,
        "title": "Gaming Setup Sale",
        "amount": "$1,250",
        "status": "1st Transaction",
        "date": "2024-01-15",
        "buyer": "TechGamer92",
        "seller": "EliteDeals",
        "description": "Complete gaming setup including RGB mechanical keyboard, gaming mouse, and ultrawide monitor. Transaction completed successfully with fast shipping and excellent packaging.",
        "media": [
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Modern gaming setup with RGB mechanical keyboard, wireless gaming mouse, and curved ultrawide monitor on a clean white desk with LED backlighting"
            },
            {
                "type": "image", 
                "url": "https://placehold.co/800x600",
                "alt": "Close-up of RGB mechanical keyboard with blue switches and custom keycaps showing detailed craftsmanship"
            }
        ],
        "rating": 5
    },
    {
        "id": 2,
        "title": "Sneaker Collection",
        "amount": "$850",
        "status": "1st Transaction",
        "date": "2024-01-12",
        "buyer": "SneakerHead23",
        "seller": "RetroKicks",
        "description": "Authentic limited edition sneakers in mint condition. Verified authenticity and fast secure shipping. Excellent communication throughout the process.",
        "media": [
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Collection of premium sneakers including Jordan retros and limited edition collaborations displayed on white shelving with proper lighting"
            },
            {
                "type": "video",
                "url": "https://placehold.co/800x600",
                "alt": "Video walkthrough of sneaker collection showing authentic details, original packaging, and condition verification"
            }
        ],
        "rating": 5
    },
    {
        "id": 3,
        "title": "Vintage Camera Deal",
        "amount": "$450",
        "status": "1st Transaction",
        "date": "2024-01-10",
        "buyer": "PhotoPro",
        "seller": "VintageGear",
        "description": "Rare vintage film camera in working condition. Includes original leather case and documentation. Perfect for collectors and photography enthusiasts.",
        "media": [
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Vintage film camera with brass accents and leather body sitting on wooden surface with original leather case and vintage photography books"
            }
        ],
        "rating": 4
    },
    {
        "id": 4,
        "title": "Art Commission",
        "amount": "$320",
        "status": "Continue",
        "date": "2024-01-18",
        "buyer": "ArtCollector",
        "seller": "DigitalArtist",
        "description": "Custom digital artwork commission for personal collection. Artist has excellent portfolio and communication. Currently in progress with regular updates.",
        "media": [
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Digital art work-in-progress showing detailed character illustration with vibrant colors and professional artistic technique"
            }
        ],
        "rating": 4
    },
    {
        "id": 5,
        "title": "Watch Collection",
        "amount": "$2,100",
        "status": "1st Transaction",
        "date": "2024-01-08",
        "buyer": "TimeKeeper",
        "seller": "LuxuryDeals",
        "description": "Luxury watch transaction with authentication certificate. Excellent condition and includes original box and papers. Professional and secure transaction.",
        "media": [
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Luxury Swiss watch with metal bracelet and blue dial displayed in original leather presentation box with authentication certificates"
            },
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Close-up of watch face showing intricate details, Swiss movement, and premium craftsmanship with proper lighting"
            }
        ],
        "rating": 5
    },
    {
        "id": 6,
        "title": "Book Collection Sale",
        "amount": "$180",
        "status": "1st Transaction",
        "date": "2024-01-05",
        "buyer": "BookWorm",
        "seller": "ClassicReads",
        "description": "Rare book collection including first editions and signed copies. All books in excellent condition with careful packaging and fast shipping.",
        "media": [
            {
                "type": "image",
                "url": "https://placehold.co/800x600",
                "alt": "Collection of vintage hardcover books with leather bindings arranged on wooden bookshelf with warm ambient lighting"
            }
        ],
        "rating": 5
    }
]